Revit 2027 API
IFCImportIntent Enumeration
 The intent of the IFC import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCImportIntent
Public Enumeration IFCImportIntent
public enum class IFCImportIntent
type IFCImportIntent
Members
Member name | Value | Description
Parametric | 0 |  Imports the IFC file to allow for continued editing in Revit (standard Revit elements will be created).
Reference | 1 |  Imports the IFC file to serve as a reference (lightweight and accurate representations will be constructed, but they cannot be edited as standard Revit elements).
See Also
Reference
Autodesk.Revit.DB.IFC Namespace